[net]
# Testing
#batch=1
#subdivisions=1
# Training
batch=64
subdivisions=16
width=416
height=416
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.0005
burn_in=1094
max_batches = 70000
policy=steps
steps=400000,450000
scales=.1,.1

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=selu

# Downsample

[convolutional]
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=selu

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=selu

[shortcut]
from=-3
activation=linear

# Downsample

[convolutional]
batch_normalize=1
filters=128
size=3
stride=2
pad=1
activation=selu

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=selu

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=selu

[shortcut]
from=-3
activation=linear

# Downsample

[convolutional]
batch_normalize=1
filters=256
size=3
stride=2
pad=1
activation=selu

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=selu

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=selu

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=selu

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=selu

[shortcut]
from=-3
activation=linear


[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=selu

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=selu

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=selu

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=selu

[shortcut]
from=-3
activation=linear

# Downsample

[convolutional]
batch_normalize=1
filters=512
size=3
stride=2
pad=1
activation=selu

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=selu

[shortcut]
from=-3
activation=linear


[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=selu

[shortcut]
from=-3
activation=linear


[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=selu

[shortcut]
from=-3
activation=linear


[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=selu

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=selu

[shortcut]
from=-3
activation=linear


[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=selu

[shortcut]
from=-3
activation=linear


[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=selu

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=selu

[shortcut]
from=-3
activation=linear

# Downsample

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=2
pad=1
activation=selu

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=selu

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=selu

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=selu

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=selu

[shortcut]
from=-3
activation=linear

######################

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=selu

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=selu

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=selu

[convolutional]
size=1
stride=1
pad=1
filters=45
activation=linear


[yolo]
mask = 6,7,8
anchors = 6,10, 14,24, 27,43, 32,97, 56,64, 92,108, 73,175, 141,178,  144,291
classes=10
num=9
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1


[route]
layers = -4

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=selu

[upsample]
stride=2

[route]
layers = -1, 61



[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=selu

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=selu

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=selu

[convolutional]
size=1
stride=1
pad=1
filters=45
activation=linear


[yolo]
mask = 3,4,5
anchors = 6,10, 14,24, 27,43, 32,97, 56,64, 92,108, 73,175, 141,178,  144,291
classes=10
num=9
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1



[route]
layers = -4

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=selu

[upsample]
stride=2

[route]
layers = -1, 36



[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=selu

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=selu

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=selu

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=selu

[convolutional]
size=1
stride=1
pad=1
filters=45
activation=linear


[yolo]
mask = 0,1,2
anchors = 6,10, 14,24, 27,43, 32,97, 56,64, 92,108, 73,175, 141,178,  144,291
classes=10
num=9
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1
